PabloDev2195/thermostat-qt-esp32/firmware/components/esp32_hal/src/esp32_gatt_svr.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <assert.h>
#include <stdio.h>
#include <string.h>
#include "host/ble_hs.h"
#include "host/ble_uuid.h"
#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"
#include "esp32_bleprph.h"
#include "services/ans/ble_svc_ans.h"

/*** Maximum number of characteristics with the notify flag ***/
#define MAX_NOTIFY 5

static const ble_uuid128_t gatt_svr_svc_uuid =
    BLE_UUID128_INIT(0x2d, 0x71, 0xa2, 0x59, 0xb4, 0x58, 0xc8, 0x12,
                     0x99, 0x99, 0x43, 0x95, 0x12, 0x2f, 0x46, 0x59);

/* A characteristic that can be subscribed to */
static uint8_t gatt_svr_chr_val;
static uint16_t gatt_svr_chr_val_handle;
static const ble_uuid128_t gatt_svr_chr_uuid =
    BLE_UUID128_INIT(0x00, 0x00, 0x00, 0x00, 0x11, 0x11, 0x11, 0x11,
                     0x22, 0x22, 0x22, 0x22, 0x33, 0x33, 0x33, 0x33);

/* Temperature characteristic — read + notify */
static int16_t gatt_svr_temp_val_x10;
static uint16_t gatt_svr_temp_val_handle;
static const ble_uuid128_t gatt_svr_temp_uuid =
    BLE_UUID128_INIT(0xab, 0xcd, 0xef, 0x01, 0x02, 0x03, 0x04, 0x05,
                     0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0e);

/* Fan characteristic — write + read + notify */
static uint8_t gatt_svr_fan_val;
static uint16_t gatt_svr_fan_val_handle;
static const ble_uuid128_t gatt_svr_fan_uuid =
    BLE_UUID128_INIT(0xab, 0xcd, 0xef, 0x01, 0x02, 0x03, 0x04, 0x05,
                     0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0f); 

/* Setpoint characteristic — write + read + notify */
static uint16_t gatt_svr_setpoint_val;
static uint16_t gatt_svr_setpoint_val_handle;
static const ble_uuid128_t gatt_svr_setpoint_uuid =
    BLE_UUID128_INIT(0xab, 0xcd, 0xef, 0x01, 0x02, 0x03, 0x04, 0x05,
                     0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d); 

/* Mode characteristic — write + read + notify */
static uint8_t gatt_svr_mode_val;
static uint16_t gatt_svr_mode_val_handle;
static const ble_uuid128_t gatt_svr_mode_uuid =
    BLE_UUID128_INIT(0xab, 0xcd, 0xef, 0x01, 0x02, 0x03, 0x04, 0x05,
                     0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0c); 

/* State characteristic — read + notify */
static int8_t gatt_svr_state_val;
static uint16_t gatt_svr_state_val_handle;
static const ble_uuid128_t gatt_svr_state_uuid =
    BLE_UUID128_INIT(0xab, 0xcd, 0xef, 0x01, 0x02, 0x03, 0x04, 0x05,
                     0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0b);

/**
 * @brief Value stored by the custom GATT descriptor.
 *
 * This descriptor exposes a read-only application-defined value.
 */
static uint8_t gatt_svr_dsc_val;
static const ble_uuid128_t gatt_svr_dsc_uuid =
    BLE_UUID128_INIT(0x01, 0x01, 0x01, 0x01, 0x12, 0x12, 0x12, 0x12,
                     0x23, 0x23, 0x23, 0x23, 0x34, 0x34, 0x34, 0x34);

/**
 * @brief Stores the callback invoked when a fan level is received.
 */
static gatt_svr_fan_level_callback_t fan_level_callback = NULL;

/**
 * @brief Stores the callback invoked when a setpoint value is received.
 */
static gatt_svr_setpoint_callback_t setpoint_callback = NULL;

/**
 * @brief Stores the callback invoked when a mode value is received.
 */
static gatt_svr_mode_callback_t mode_callback = NULL;

/**
 * @brief Handle GATT characteristic and descriptor access operations.
 *
 * Processes read and write requests generated by the NimBLE GATT server.
 * The requested attribute is identified using its attribute handle and
 * operation type.
 *
 * @param[in] conn_handle BLE connection handle associated with the request.
 * @param[in] attr_handle Attribute handle being accessed.
 * @param[in] ctxt GATT access context provided by the NimBLE stack.
 * @param[in] arg User-defined argument provided by the GATT server.
 *
 * @return
 * - 0 if the operation was handled successfully.
 * - A BLE ATT error code if the operation could not be completed.
 */
static int
gatt_svc_access(uint16_t conn_handle, uint16_t attr_handle,
                struct ble_gatt_access_ctxt *ctxt,
                void *arg);

static const struct ble_gatt_svc_def gatt_svr_svcs[] = {
    {
        /*** Service ***/
        .type = BLE_GATT_SVC_TYPE_PRIMARY,
        .uuid = &gatt_svr_svc_uuid.u,
        .characteristics = (struct ble_gatt_chr_def[])
        { 
            {
                /*** This characteristic can be subscribed to by writing 0x00 and 0x01 to the CCCD ***/
                .uuid = &gatt_svr_chr_uuid.u,
                .access_cb = gatt_svc_access,
#if CONFIG_EXAMPLE_ENCRYPTION
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE |
                BLE_GATT_CHR_F_READ_ENC | BLE_GATT_CHR_F_WRITE_ENC |
                BLE_GATT_CHR_F_NOTIFY | BLE_GATT_CHR_F_INDICATE,
#else
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE | BLE_GATT_CHR_F_NOTIFY | BLE_GATT_CHR_F_INDICATE,
#endif
                .val_handle = &gatt_svr_chr_val_handle,
                .descriptors = (struct ble_gatt_dsc_def[])
                { 
                    {
                      .uuid = &gatt_svr_dsc_uuid.u,
#if CONFIG_EXAMPLE_ENCRYPTION
                      .att_flags = BLE_ATT_F_READ | BLE_ATT_F_READ_ENC,
#else
                      .att_flags = BLE_ATT_F_READ,
#endif
                      .access_cb = gatt_svc_access,
                    }, 
                    {
                      0, /* No more descriptors in this characteristic */
                    }
                },
            }, 
            {
                /*** Temperature characteristic ***/
                .uuid = &gatt_svr_temp_uuid.u,
                .access_cb = gatt_svc_access,
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_NOTIFY,
                .val_handle = &gatt_svr_temp_val_handle,
            }, 
            {
                /*** Fan characteristic ***/
                .uuid = &gatt_svr_fan_uuid.u,
                .access_cb = gatt_svc_access,
                .flags = BLE_GATT_CHR_F_READ |
                         BLE_GATT_CHR_F_WRITE |
                         BLE_GATT_CHR_F_NOTIFY,
                .val_handle = &gatt_svr_fan_val_handle,
            }, 
            {
                /*** Setpoint characteristic ***/
                .uuid = &gatt_svr_setpoint_uuid.u,
                .access_cb = gatt_svc_access,
                .flags = BLE_GATT_CHR_F_READ |
                         BLE_GATT_CHR_F_WRITE |
                         BLE_GATT_CHR_F_NOTIFY,
                .val_handle = &gatt_svr_setpoint_val_handle,
            }, 
            {
                /*** Mode characteristic ***/
                .uuid = &gatt_svr_mode_uuid.u,
                .access_cb = gatt_svc_access,
                .flags = BLE_GATT_CHR_F_READ |
                         BLE_GATT_CHR_F_WRITE |
                         BLE_GATT_CHR_F_NOTIFY,
                .val_handle = &gatt_svr_mode_val_handle,
            },
            {
                /*** State characteristic ***/
                .uuid = &gatt_svr_state_uuid.u,
                .access_cb = gatt_svc_access,
                .flags = BLE_GATT_CHR_F_READ | 
                         BLE_GATT_CHR_F_NOTIFY,
                .val_handle = &gatt_svr_state_val_handle,
            }, 
            {
                0, /* No more characteristics in this service. */
            }
        },
    },

    {
        0, /* No more services. */
    },
};

/**
 * @brief Validate and copy data from a BLE mbuf to a destination buffer.
 *
 * Validates that the received attribute value has a length within the
 * specified range and copies the data from the NimBLE mbuf into the
 * destination buffer.
 *
 * @param[in] om Source mbuf containing the received BLE data.
 * @param[in] min_len Minimum accepted data length.
 * @param[in] max_len Maximum accepted data length.
 * @param[out] dst Destination buffer where the data will be copied.
 * @param[out] len Pointer where the number of copied bytes is stored.
 *
 * @return
 * - 0 if the data was copied successfully.
 * - BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN if the data length is invalid.
 * - BLE_ATT_ERR_UNLIKELY if the data could not be copied.
 */
static int
gatt_svr_write(struct os_mbuf *om, uint16_t min_len, uint16_t max_len,
               void *dst, uint16_t *len)
{
    uint16_t om_len;
    int rc;

    om_len = OS_MBUF_PKTLEN(om);
    if (om_len < min_len || om_len > max_len) {
        return BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
    }

    rc = ble_hs_mbuf_to_flat(om, dst, max_len, len);
    if (rc != 0) {
        return BLE_ATT_ERR_UNLIKELY;
    }

    return 0;
}

/**
 * Access callback whenever a characteristic/descriptor is read or written to.
 * Here reads and writes need to be handled.
 * ctxt->op tells weather the operation is read or write and
 * weather it is on a characteristic or descriptor,
 * ctxt->dsc->uuid tells which characteristic/descriptor is accessed.
 * attr_handle give the value handle of the attribute being accessed.
 * Accordingly do:
 *     Append the value to ctxt->om if the operation is READ
 *     Write ctxt->om to the value if the operation is WRITE
 **/
static int
gatt_svc_access(uint16_t conn_handle, uint16_t attr_handle,
                struct ble_gatt_access_ctxt *ctxt, void *arg)
{
    const ble_uuid_t *uuid;
    int rc;

    switch (ctxt->op) 
    {
    case BLE_GATT_ACCESS_OP_READ_CHR:
        if (conn_handle != BLE_HS_CONN_HANDLE_NONE) 
        {
            MODLOG_DFLT(INFO, "Characteristic read; conn_handle=%d attr_handle=%d\n",
                        conn_handle, attr_handle);
        } 
        else 
        {
            MODLOG_DFLT(INFO, "Characteristic read by NimBLE stack; attr_handle=%d\n",
                        attr_handle);
        }
        uuid = ctxt->chr->uuid;
        if (attr_handle == gatt_svr_chr_val_handle) 
        {
            rc = os_mbuf_append(ctxt->om,
                                &gatt_svr_chr_val,
                                sizeof(gatt_svr_chr_val));
            return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        if (attr_handle == gatt_svr_temp_val_handle)
        {
            rc = os_mbuf_append(ctxt->om,
                                &gatt_svr_temp_val_x10,
                                sizeof(gatt_svr_temp_val_x10));
            return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        if (attr_handle == gatt_svr_fan_val_handle)
        {
            rc = os_mbuf_append(ctxt->om,
                                &gatt_svr_fan_val,
                                sizeof(gatt_svr_fan_val));
            return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        if (attr_handle == gatt_svr_setpoint_val_handle)
        {
            rc = os_mbuf_append(ctxt->om,
                                &gatt_svr_setpoint_val,
                                sizeof(gatt_svr_setpoint_val));
            return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        if (attr_handle == gatt_svr_mode_val_handle)
        {
            rc = os_mbuf_append(ctxt->om,
                                &gatt_svr_mode_val,
                                sizeof(gatt_svr_mode_val));
            return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        if (attr_handle == gatt_svr_state_val_handle)
        {
            rc = os_mbuf_append(ctxt->om,
                                &gatt_svr_state_val,
                                sizeof(gatt_svr_state_val));
            return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        goto unknown;

    case BLE_GATT_ACCESS_OP_WRITE_CHR:
        if (conn_handle != BLE_HS_CONN_HANDLE_NONE) {
            MODLOG_DFLT(INFO, "Characteristic write; conn_handle=%d attr_handle=%d",
                        conn_handle, attr_handle);
        } else {
            MODLOG_DFLT(INFO, "Characteristic write by NimBLE stack; attr_handle=%d",
                        attr_handle);
        }
        uuid = ctxt->chr->uuid;
        if (attr_handle == gatt_svr_chr_val_handle) {
            rc = gatt_svr_write(ctxt->om,
                                sizeof(gatt_svr_chr_val),
                                sizeof(gatt_svr_chr_val),
                                &gatt_svr_chr_val, NULL);
            ble_gatts_chr_updated(attr_handle);
            MODLOG_DFLT(INFO, "Notification/Indication scheduled for "
                        "all subscribed peers.\n");
            return rc;
        }
        if (attr_handle == gatt_svr_fan_val_handle)
        {
            rc = gatt_svr_write(ctxt->om,
                                sizeof(gatt_svr_fan_val),
                                sizeof(gatt_svr_fan_val),
                                &gatt_svr_fan_val, NULL);
            if (rc == 0) 
            {
                if(fan_level_callback != NULL)
                {
                    fan_level_callback(gatt_svr_fan_val);
                }
            }
            return rc;
        }
        if (attr_handle == gatt_svr_setpoint_val_handle)
        {
            rc = gatt_svr_write(ctxt->om,
                                sizeof(gatt_svr_setpoint_val),
                                sizeof(gatt_svr_setpoint_val),
                                &gatt_svr_setpoint_val, NULL);
            if (rc == 0) 
            {
                if(setpoint_callback != NULL)
                {
                    setpoint_callback(gatt_svr_setpoint_val);
                }
            }
            return rc;
        }
        if (attr_handle == gatt_svr_mode_val_handle)
        {
            rc = gatt_svr_write(ctxt->om,
                                sizeof(gatt_svr_mode_val),
                                sizeof(gatt_svr_mode_val),
                                &gatt_svr_mode_val, NULL);
            if (rc == 0) 
            {
                if(mode_callback != NULL)
                {
                    mode_callback(gatt_svr_mode_val);
                }
            }
            return rc;
        }
        goto unknown;

    case BLE_GATT_ACCESS_OP_READ_DSC:
        if (conn_handle != BLE_HS_CONN_HANDLE_NONE) {
            MODLOG_DFLT(INFO, "Descriptor read; conn_handle=%d attr_handle=%d\n",
                        conn_handle, attr_handle);
        } else {
            MODLOG_DFLT(INFO, "Descriptor read by NimBLE stack; attr_handle=%d\n",
                        attr_handle);
        }
        uuid = ctxt->dsc->uuid;
        if (ble_uuid_cmp(uuid, &gatt_svr_dsc_uuid.u) == 0) {
            rc = os_mbuf_append(ctxt->om,
                                &gatt_svr_dsc_val,
                                sizeof(gatt_svr_chr_val));
            return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        goto unknown;

    case BLE_GATT_ACCESS_OP_WRITE_DSC:
        goto unknown;

    default:
        goto unknown;
    }

unknown:
    /* Unknown characteristic/descriptor;
     * The NimBLE host should not have called this function;
     */
    assert(0);
    return BLE_ATT_ERR_UNLIKELY;
}

/**
 * @brief GATT server registration callback.
 *
 * Called by the NimBLE GATT server when a service, characteristic,
 * or descriptor is registered.
 *
 * Logs the UUID and assigned attribute handles for the registered
 * GATT elements.
 *
 * @param[in] ctxt Registration context provided by the NimBLE stack.
 * @param[in] arg User-defined argument provided during registration.
 */
void
gatt_svr_register_cb(struct ble_gatt_register_ctxt *ctxt, void *arg)
{
    char buf[BLE_UUID_STR_LEN];

    switch (ctxt->op) {
    case BLE_GATT_REGISTER_OP_SVC:
        MODLOG_DFLT(DEBUG, "registered service %s with handle=%d\n",
                    ble_uuid_to_str(ctxt->svc.svc_def->uuid, buf),
                    ctxt->svc.handle);
        break;

    case BLE_GATT_REGISTER_OP_CHR:
        MODLOG_DFLT(DEBUG, "registering characteristic %s with "
                    "def_handle=%d val_handle=%d\n",
                    ble_uuid_to_str(ctxt->chr.chr_def->uuid, buf),
                    ctxt->chr.def_handle,
                    ctxt->chr.val_handle);
        break;

    case BLE_GATT_REGISTER_OP_DSC:
        MODLOG_DFLT(DEBUG, "registering descriptor %s with handle=%d\n",
                    ble_uuid_to_str(ctxt->dsc.dsc_def->uuid, buf),
                    ctxt->dsc.handle);
        break;

    default:
        assert(0);
        break;
    }
}

/**
 * @brief Initialize the GATT server.
 *
 * Initializes the required standard GATT services and registers the
 * application-defined GATT services, characteristics, and descriptors
 * with the NimBLE stack.
 *
 * Also initializes the value of the custom read-only descriptor.
 *
 * @return
 * - 0 if the GATT server was initialized successfully.
 * - A non-zero error code if GATT configuration or service registration
 *   failed.
 */
int
gatt_svr_init(void)
{
    int rc;

#if CONFIG_BT_NIMBLE_GAP_SERVICE
    ble_svc_gap_init();
#endif /* CONFIG_BT_NIMBLE_GAP_SERVICE */
#if MYNEWT_VAL(BLE_GATTS)
    ble_svc_gatt_init();
#endif
#if CONFIG_BT_NIMBLE_ANS_SERVICE
    ble_svc_ans_init();
#endif

    rc = ble_gatts_count_cfg(gatt_svr_svcs);
    if (rc != 0) {
        return rc;
    }

    rc = ble_gatts_add_svcs(gatt_svr_svcs);
    if (rc != 0) {
        return rc;
    }

    /* Setting a value for the read-only descriptor */
    gatt_svr_dsc_val = 0x99;

    return 0;
}

/**
 * @brief Update and notify the BLE temperature characteristic.
 *
 * Converts the temperature value from degrees Celsius to an integer
 * representation in tenths of a degree Celsius and stores it in the
 * temperature characteristic value.
 *
 * If a BLE client is currently connected, sends the updated temperature
 * value to the client through a GATT notification.
 *
 * @param[in] temperature_c Temperature value in degrees Celsius.
 * @param[in] conn_handle BLE connection handle of the client.
 */
void gatt_svr_set_temperature(float temperature_c, uint16_t conn_handle)
{
    gatt_svr_temp_val_x10 = (int16_t)(temperature_c * 10);

    if (conn_handle != BLE_HS_CONN_HANDLE_NONE) 
    {
        struct os_mbuf *om = ble_hs_mbuf_from_flat(&gatt_svr_temp_val_x10,
                                                     sizeof(gatt_svr_temp_val_x10));
        ble_gatts_notify_custom(conn_handle, gatt_svr_temp_val_handle, om);
    }
}

/**
 * @brief Updates and notifies the current thermostat state via BLE.
 *
 * Stores the specified state in the GATT state characteristic value.
 * If a valid BLE connection handle is provided, sends a notification
 * to the connected client using the custom GATT notification mechanism.
 *
 * @param[in] state       New thermostat state value to be stored and notified.
 * @param[in] conn_handle BLE connection handle of the target client.
 *
 * @note Notifications are sent only when conn_handle is different from
 *       BLE_HS_CONN_HANDLE_NONE.
 * @note The client must have enabled notifications for the state
 *       characteristic to receive the update.
 */
void gatt_svr_set_state(uint8_t state, uint16_t conn_handle)
{
    gatt_svr_state_val = state;

    if (conn_handle != BLE_HS_CONN_HANDLE_NONE) 
    {
        struct os_mbuf *om = ble_hs_mbuf_from_flat(&gatt_svr_state_val,
                                                     sizeof(gatt_svr_state_val));
        ble_gatts_notify_custom(conn_handle, gatt_svr_state_val_handle, om);
    }
}

/**
 * @brief Registers the callback for handling fan level updates.
 *
 * @param callback Callback function to invoke when a fan level is received.
 */
void gatt_svr_set_fan_level_callback(gatt_svr_fan_level_callback_t callback)
{
    fan_level_callback = callback;
}

/**
 * @brief Registers the callback for handling setpoint values updates.
 *
 * @param callback Callback function to invoke when a setpoint value is received.
 */
void gatt_svr_set_setpoint_callback(gatt_svr_setpoint_callback_t callback)
{
    setpoint_callback = callback;
}

/**
 * @brief Registers the callback for handling setpoint values updates.
 *
 * @param callback Callback function to invoke when a setpoint value is received.
 */
void gatt_svr_set_mode_callback(gatt_svr_mode_callback_t callback)
{
    mode_callback = callback;
}